---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
source: html/10b38722-6590-2857-9b0d-53057c14c06f.htm
---
# VertexStreamPositionNormalColored Properties

Specifies whether the .NET object represents a valid Revit entity.